interface Rules {
  title: string;
  content: string[];
}

export const rules: Rules[] = [
  {
    title: '제 1조 [목적]',
    content: [
      '이 약관은 크로스핏 백호(이하 "백호")와 "백호"에서 제공하는 시설 및 서비스를 이용하는 자(이하 "회원") 사이에 체결된 계약에 따른 권리와 의무에 관한 사항을 정함을 목적으로 합니다.',
    ],
  },
  {
    title: '제 2조 [적용대상]',
    content: ['이 약관은 "백호"를 이용하는 모든 "회원"에게 적용됩니다.'],
  },
  {
    title: '제 3조 [이용계약]',
    content: [
      '"회원"은 "백호"에서 정한 절차에 따라 회원가입 신청서를 작성 하고 이용료를 납부하여야 합니다.',
    ],
  },
  {
    title: '제 4조 [이용시간 및 휴관]',
    content: [
      '1. 평일: 07:00 ~ 23:00 / 토요일: 12:50 ~ 15:00 / 일요일, 법정공휴일 및 하계, 동계 휴가 3일(평일): 휴관(회원권 연장 없음)',
      '2. 운영 시간은 "백호" 사정에 의해 변동 될 수 있습니다.',
    ],
  },
  {
    title: '제 5조 [회원권 환불.양도.정지]',
    content: [
      '1. 회원권 환불시 결제 금액에 대하여 10%의 위약금과 경과된 기간에 따른 해당금액(이용료)을 공제하고 환불됩니다. (단, 회원권 시작일전 환불은 카드 10% 공제, 현금영수증신청시 10% 공제 후 환불됩니다.)',
      '2. 모든 회원권은 양도가 불가능합니다. (단, 가족 간 양도는 가능)',
      '3. 회원권 정지는 희망 정지일 최소 하루 전에는 신청해야합니다. (1개월 회원권 - 정지 없음 / 3개월 회원권 - 1회 최대 10일에 한하여 정지 가능) *학생 할인을 받은 회원은 회원권 연장 없음',
      '4. 기타 "백호" 운영상 합당한 사유(출장, 파견, 입원 등)로 정당한 증빙서류를 제출시 "백호" 운영자의 확인 후 정지가 가능합니다. *증빙서류 : 파견근무확인서, 출장증명서, 의사소견서, 진단서 등 (1회 최대 10일)',
    ],
  },
  {
    title: '제 6조 [책임한계 및 손해배상]',
    content: [
      '1."회원"은 크로스핏 운동 시 발생 할 수 있는 여타의 상해 및 사고의 위험을 인지하고 항상 주의해야하며, 이용자의 고의 또는 과실에 의한 상해 및 사고의 책임은 "회원" 본인에게 있습니다.',
      '2. 심신질환이나 질병으로 건강상 이상이 있을 때에는 반드시 사전에 "백호"에게 이를 고지하고 운영자의 지시를 따라야 합니다.',
      '3. 사전에 고지도지 않은 질병이나 질환으로 인한 무제 발생 시 "백호"는 이에 대한 책임을 지지 않으며 회원자격을 제한 할 수 있습니다.',
      '4. "회원"의 고의 또는 과실로 인하여 다른 회원이 상해를 입을시 가해 "회원"은 손해배상을 해야 합니다.',
      '5. "회원"의 고의 또는 과실로 "백호"의 물품 또는 이용시설에 손해가 발생한 경우 이를 배상하여야 합니다.',
    ],
  },
  {
    title: '제 7조 [개인정보 및 물품]',
    content: [
      '1. "회원" 개인물품의 보관 및 관리는 전적으로 "회원"의 책임이며 "백호"는 "백호" 내에서 분실하거나 도난당한 물품에 대해서 책임 지지 않습니다.',
      '2. 개인물품을 "백호"에 보관하고 최종 방문일일부터 1개월 이상 찾아가지 않을 시 "백호" 운영자는 이를 임의로 처분할 수 있습니다.',
      '3. "백호"는 운영에 필요한 최소한의 개인정보를 수집하고 있으며 "백호" 운영을 위한 용도로만 활용됩니다.',
      '4. "백호"는 "회원"의 "백호" 이용에 대한 사진과 동영상 촬영 및 제작을 할 수 있으며 이 경우 "회원"의 초상권은 "백호"에 귀속되며 사전 고지 없이 홍보 목적으로 사용 할 수 있습니다.',
    ],
  },
  {
    title: '제 8조 [사물함]',
    content: [
      '1. "회원"은 사물함 이용 기간 종료와 동시에 사물함을 "백호" 운영자에게 반환하여야 합니다.',
      '2. 사물함 이용 기간 종료 후 1개월이 지나도 찾아가지 않는 물품은 "백호"에서 임의로 처분 할 수  있습니다.',
    ],
  },
];
